[A_PoisonCloud_Buff H7BaseBuff]
mName="毒雾蔓延"

[Imprinted.A_PoisonSpray_Imprinted_Buff H7BaseBuff]
mName="毒液喷射"
mTooltip="在目标生物回合开始时，对其造成 %d.min %d.icon 土系伤害。\n持续 %durnow 回合。"

[A_StoneSkin_Buff H7BaseBuff]
mName="护体石肤"
mTooltip="%stat %ICON_DEFENSE 防御\n持续 %durnow 回合。"

[Imprinted.A_Regeneration_Imprinted_Buff H7BaseBuff]
mName="活力再生"
mTooltip="在生物回合开始时，治疗并复活其 %d.min 点生命值。\n持续 %durnow 回合。"

[A_PoisonCloud H7HeroAbility]
mTooltipMagicGuild="在目标3x3区域制造一片毒云，持续 %durini 回合，每回合向各个方向扩散1格。毒云会立即、在所有生物回合开始时以及对进入毒云的生物造成 %buff1.buff.d1.min %buff1.buff.d1.icon 土系伤害。"
mTooltipMagicGuildRankLine="%buff1.buff.d1.min %buff1.buff.d1.icon"
mName="毒雾蔓延"
mTooltip="在目标3x3区域制造一片毒云，持续 %durini 回合，每回合向各个方向扩散1格。毒云会立即、在所有生物回合开始时以及对进入毒云的生物造成 %buff1.buff.d1.min %buff1.buff.d1.icon 土系伤害。"

[Imprinted.A_Entangle_Imprinted H7HeroAbility]
mName="大地缠绕"
mTooltip="降低目标敌方生物 %buff1.buff.stat1.norm 点 %buff1.buff.stat1.icon 移动力，并阻止其使用基于移动的技能，持续 %buff1.buff.durini 回合。不影响传送类生物。"

[A_StoneSkin H7HeroAbility]
mTooltipMagicGuild="提升目标友方生物的 %ICON_DEFENSE 防御，持续 %buff.buff.durini 回合。"
mTooltipMagicGuildRankLine="%buff.buff.stat %buff.buff.stat.icon 防御"
mTooltipUpgraded="提升目标4x4区域内所有友方生物 %buff.buff.stat.norm 点 %ICON_DEFENSE 防御，持续 %buff.buff.durini 回合。"
mName="护体石肤"
mTooltip="提升目标友方生物 %buff.buff.stat.norm 点 %ICON_DEFENSE 防御，持续 %buff.buff.durini 回合。"

[Imprinted.A_PoisonCloud_Imprinted_Buff H7BaseBuff]
mName="毒雾蔓延"

[A_PoisonSpray_Buff_Upgraded H7BaseBuff]
mName="毒液喷射"
mTooltip="在目标生物回合开始时，对其造成 %d.min %d.icon 土系伤害。\n持续整场战斗。"

[A_Entangle_FromCreature_Buff H7BaseBuff]
mName="大地缠绕"
mTooltip="%stat %stat.icon 移动力\n该生物无法使用基于移动的技能。\n持续 %durnow 回合。"

[A_Entangle_Buff_Upgraded H7BaseBuff]
mName="大地缠绕"
mTooltip="%stat1 %stat1.icon 移动力\n该生物无法使用基于移动的技能，并在移动时受到 %dam.min %dam.icon 土系伤害。\n持续 %durnow 回合。"

[A_PoisonSpray_Buff H7BaseBuff]
mName="毒液喷射"
mTooltip="在目标生物回合开始时，对其造成 %d.min %d.icon 土系伤害。\n持续 %durnow 回合。"

[A_Regeneration_Buff H7BaseBuff]
mName="活力再生"
mTooltip="在生物回合开始时，治疗并复活其 %d.min 点生命值。\n持续 %durnow 回合。"

[Imprinted.A_PoisonCloud_Imprinted H7HeroAbility]
mName="毒雾蔓延"
mTooltip="在目标3x3区域制造一片毒云，持续 %durini 回合，每回合向各个方向扩散1格。毒云会立即、在所有生物回合开始时以及对进入毒云的生物造成 %buff1.buff.d1.min %buff1.buff.d1.icon 土系伤害。"

[A_SylannasBounty H7HeroAbility]
mTooltipMagicGuild="使同一控制区内的目标锯木厂或矿石坑的产量在接下来的几天内翻倍。"
mTooltipMagicGuildRankLine="%buff1.buff.durini 天"
mName="土龙恩赐"
mTooltip="使同一控制区内的目标锯木厂或矿石坑的产量在接下来的 %buff1.buff.durini 天内翻倍。"

[A_SylannasBounty_Buff H7BaseBuff]
mName="土龙恩赐"
mTooltip="产量在接下来的 %durnow 天内翻倍。"

[Imprinted.A_PoisonSpray_Imprinted H7HeroAbility]
mName="毒液喷射"
mTooltip="在目标敌方生物接下来的 %buff1.buff.durini1 个回合开始时，对其造成 %buff1.buff.d.min %buff1.buff.d.icon 土系伤害。"

[Imprinted.A_StoneSkin_Imprinted H7HeroAbility]
mName="护体石肤"
mTooltip="提升目标友方生物 %buff.buff.stat.norm 点 %ICON_DEFENSE 防御，持续 %buff.buff.durini 回合。"

[Imprinted.A_Entangle_Imprinted_Buff H7BaseBuff]
mName="大地缠绕"
mTooltip="%stat %stat.icon 移动力\n该生物无法使用基于移动的技能。\n持续 %durnow 回合。"

[Imprinted.A_Earthquake_Imprinted H7HeroAbility]
mName="地动山摇"
mTooltip="立即对所有地面单位造成 %d3.min %d3.icon 土系伤害，并对所有城镇城墙和箭塔造成 %d1.min %d1.icon 土系伤害。受损的城防设施受到双倍伤害。"

[A_PoisonSpray H7HeroAbility]
mTooltipMagicGuild="在目标敌方生物接下来的 %buff1.buff.durini1 个回合开始时，对其造成 %ICON_EARTH 土系伤害。"
mTooltipMagicGuildRankLine="%buff1.buff.d.min %buff1.buff.d.icon"
mTooltipUpgraded="在目标敌方生物回合开始时，对其造成 %buff2.buff.d.min %buff2.buff.d.icon 土系伤害。\n持续至战斗结束。"
mName="毒液喷射"
mTooltip="在目标敌方生物接下来的 %buff1.buff.durini1 个回合开始时，对其造成 %buff1.buff.d.min %buff1.buff.d.icon 土系伤害。"

[Imprinted.A_StoneSpikes_Imprinted H7HeroAbility]
mName="巨石利刺"
mTooltip="立即对目标十字形区域内的所有单位造成 %d.min %d.icon 土系伤害。"

[Imprinted.A_StoneSkin_Imprinted_Buff H7BaseBuff]
mName="护体石肤"
mTooltip="%stat %ICON_DEFENSE 防御\n持续 %durnow 回合。"

[Imprinted.A_StoneSpikes_Imprinted_Artifact H7HeroAbility]
mName="巨石利刺"
mTooltip="立即对目标十字形区域内的所有单位造成 %d.min %d.icon 土系伤害。"

[Imprinted.A_SylannasBounty_Imprinted H7HeroAbility]
mName="土龙恩赐"
mTooltip="使同一控制区内的目标锯木厂或矿石坑的产量在接下来的 %buff1.buff.durini 天内翻倍。"

[Imprinted.A_SylannasBounty_Imprinted_Artifact H7HeroAbility]
mName="土龙恩赐"
mTooltip="使同一控制区内的目标锯木厂或矿石坑的产量在接下来的 %buff1.buff.durini 天内翻倍。"

[Imprinted.A_SylannasBounty_Imprinted_Artifact_Buff H7BaseBuff]
mName="土龙恩赐"
mTooltip="产量翻倍。"

[Imprinted.A_SylannasBounty_Imprinted_Buff H7BaseBuff]
mName="土龙恩赐"
mTooltip="产量在接下来的 %durnow 天内翻倍。"

[A_Poisoned_Buff H7BaseBuff]
mName="身受剧毒"
mTooltip="在生物回合开始时，对其造成 %d1.min 到 %d1.max %d.icon 土系伤害。\n持续 %durnow 回合。"



UCP MOD

[Imprinted.A_Regeneration_Imprinted H7HeroAbility]
mName="活力再生"
mTooltip="在目标友方生物接下来的 %buff.buff.durini 个回合开始时，治疗并复活其 %buff.buff.d.min 点生命值。\n（不受影响：亡灵和构造体）"

[A_Regeneration H7HeroAbility]
mTooltipMagicGuild="在目标友方生物接下来的 %buff.buff.durini 个回合开始时，治疗并复活该生物。\n（不受影响：亡灵和构造体）"
mTooltipMagicGuildRankLine="%buff.buff.d.min 生命值"
mTooltipUpgraded="在目标3x3区域内所有友方生物接下来的 %buff.buff.durini 个回合开始时，治疗并复活其 %buff.buff.d.min 点生命值。\n（不受影响：亡灵和构造体）"
mName="活力再生"
mTooltip="在目标友方生物接下来的 %buff.buff.durini 个回合开始时，治疗并复活其 %buff.buff.d.min 点生命值。\n（不受影响：亡灵和构造体）"

UCP 1.3 / 7.5_mod

[Imprinted.A_WaspSwarm_Imprinted H7HeroAbility]
mName="蜂群侵袭"
mTooltip="对目标敌方生物施放蜂群。蜂群在施加时造成 %buff1.buff.d.min %icon_earth 土系伤害，并且该生物在下一个回合结束前拥有 %buff1.buff.buff1.buff.stat %icon_destiny 幸运。当带有蜂群的生物回合开始或其死亡时，蜂群会转移到另一个敌方生物身上。\n蜂群将攻击敌人 %buff2.buff.durini 回合。"

[Imprinted.A_WaspSwarm_Imprinted_Artifact H7HeroAbility]
mName="蜂群侵袭"
mTooltip="对目标敌方生物施放蜂群。蜂群在施加时造成 %buff1.buff.d.min %icon_earth 土系伤害，并且该生物在下一个回合结束前拥有 %buff1.buff.buff1.buff.stat %icon_destiny 幸运。当带有蜂群的生物回合开始或其死亡时，蜂群会转移到另一个敌方生物身上。\n蜂群将攻击敌人 %buff2.buff.durini 回合。"

[A_WaspSwarm_Luck_Buff H7BaseBuff]
mName="蜂群侵袭"
mTooltip="%stat %icon_destiny 幸运，持续到该生物下一回合结束。"

[A_WaspSwarm_Hero_Buff H7BaseBuff]
mName="蜂群侵袭"
mTooltip="蜂群效果将攻击敌人 %durnow 回合。此攻击对随机敌人造成 %d1.norm %icon_earth 土系伤害。"

[Imprinted.A_WaspSwarm_Imprinted_Artifact_Hero_Buff H7BaseBuff]
mName="蜂群侵袭"
mTooltip="蜂群效果将攻击敌人 %durnow 回合。"

[Imprinted.A_WaspSwarm_Imprinted_Hero_Buff H7BaseBuff]
mName="蜂群侵袭"
mTooltip="蜂群效果将攻击敌人 %durnow 回合。"

[Rework.A_Burningdetermination H7HeroAbility]
mTooltipMagicGuild="提升目标友方生物的 %ICON_DEFENSE 防御，持续 %buff.buff.durini 回合。"
mTooltipMagicGuildRankLine="%buff.buff.stat %buff.buff.stat.icon 防御"
mTooltipUpgraded="提升目标4x4区域内所有友方生物 %buff.buff.stat.norm 点 %ICON_DEFENSE 防御，持续 %buff.buff.durini 回合。"
mName="护体石肤"
mTooltip="提升目标友方生物 %buff.buff.stat.norm 点 %ICON_DEFENSE 防御，持续 %buff.buff.durini 回合。"

[A_WaspSwarm_Marker_Buff H7BaseBuff]
mName="被蜂群标记"
mTooltip="蜂群在此生物身上。"

v1.31

[A_StoneSpikes H7HeroAbility]
mTooltipMagicGuild="立即对目标十字形区域内的所有单位造成 %ICON_EARTH 土系伤害。\n（冷却时间：%buff9.buff.durini 回合）"
mTooltipMagicGuildRankLine="%d.min %d.icon"
mTooltipUpgraded="立即对目标十字形区域内的所有单位造成 %d.min %d.icon 土系伤害。中心的单位受到双倍伤害。\n（冷却时间：%buff9.buff.durini 回合）"
mName="巨石利刺"
mTooltip="立即对目标十字形区域内的所有单位造成 %d.min %d.icon 土系伤害。\n（冷却时间：%buff9.buff.durini 回合）"

v1.35

[A_Earthquake H7HeroAbility]
mTooltipMagicGuild="立即对所有地面单位、城镇城墙和箭塔造成 %icon_earth 土系伤害。受损的城防设施受到双倍伤害。"
mTooltipMagicGuildRankLine="%d3.min %d3.icon 对单位，%d1.min %d1.icon 对建筑"
mTooltipUpgraded="立即对所有地面单位造成 %d7.min %d7.icon 土系伤害，并对所有城镇城墙和箭塔造成 %d4.min %d4.icon 土系伤害。敌方单位和已受损的城防设施受到双倍伤害。（冷却时间：%buff9.buff.durini 回合）。"
mName="地动山摇"
mTooltip="立即对所有地面单位造成 %d3.min %d3.icon 土系伤害，并对所有城镇城墙和箭塔造成 %d1.min %d1.icon 土系伤害。受损的城防设施受到双倍伤害。（冷却时间：%buff9.buff.durini 回合）。"

[Boue.A_Boue_deBuff2 H7BaseBuff]
mName="净化之泥"
mTooltip=""

[Boue.A_Nova H7HeroAbility]
mTooltipMagicGuild="立即对目标敌方单位造成 %d.icon 土系伤害。"
mTooltipMagicGuildRankLine="%d.min 到 %d.max %d.icon"
mTooltipUpgraded="立即对目标敌方单位造成 %d.min 到 %d.max %icon_earth 土系伤害，并移除目标的2个增益效果。\n（冷却时间：%buff9.buff.durini 回合）。"
mName="净化之泥"
mTooltip="立即对目标敌方单位造成 %d.min 到 %d.max %icon_earth 土系伤害，并移除目标的1个增益效果。\n如果英雄拥有土系学识II，%spell.name4 会驱散额外目标的1个增益效果。\n（冷却时间：%buff9.buff.durini 回合）。"

[Boue.A_Boue_deBuff H7BaseBuff]
mName="净化之泥"
mTooltip=""

v1.37

[rework.A_Nova H7HeroAbility]
mTooltipMagicGuild="在目标3x3区域制造一片毒云，持续 %durini 回合，每回合向各个方向扩散1格。毒云会立即、在所有生物回合开始时以及对进入毒云的生物造成 %buff1.buff.d1.min %buff1.buff.d1.icon 土系伤害。\n（冷却时间：%buff9.buff.durini 回合）"
mTooltipMagicGuildRankLine="%buff1.buff.d1.min %buff1.buff.d1.icon"
mTooltipUpgraded=""
mName="毒雾蔓延"
mTooltip="在目标3x3区域制造一片毒云，持续 %durini 回合，每回合向各个方向扩散1格。毒云会立即、在所有生物回合开始时以及对进入毒云的生物造成 %buff1.buff.d1.min %buff1.buff.d1.icon 土系伤害。\n（冷却时间：%buff9.buff.durini 回合）\n如果英雄拥有超过12点 %icon_ARCANE_KNOWLEDGE 奥术知识，则冷却时间变为：%buff8.buff.durini 回合。"

[rework2.A_Nova H7HeroAbility]
mTooltipMagicGuild="向目标敌方生物释放蜂群。蜂群施加时造成 %d.norm %icon_earth 土系伤害，并且该生物在下一个回合结束前拥有 %buff1.buff.buff2.buff.stat %icon_destiny 幸运。当带有蜂群的生物回合开始或其死亡时，蜂群会转移到另一个敌方生物身上，持续 %buff2.buff.durini.norm 回合。\n（冷却时间：%buff9.buff.durini 回合）"
mTooltipMagicGuildRankLine="%buff1.buff.d.min %icon_earth 土系伤害。影响敌人 %buff2.buff.durini 回合。"
mTooltipUpgraded=""
mName="蜂群侵袭"
mTooltip="向目标敌方生物释放蜂群。蜂群施加时造成 %d.norm %icon_earth 土系伤害，并且该生物在下一个回合结束前拥有 %buff1.buff.buff2.buff.stat %icon_destiny 幸运。当带有蜂群的生物回合开始或其死亡时，蜂群会转移到另一个敌方生物身上，持续 %buff2.buff.durini.norm 回合。\n（冷却时间：%buff9.buff.durini 回合）\n如果英雄拥有超过12点 %icon_ARCANE_KNOWLEDGE 奥术知识，则冷却时间变为：%buff8.buff.durini 回合。"

[Treelife.A_SummonElemental H7HeroAbility]
mTooltipMagicGuild="立即在战斗地图上召唤生命之花。"
mTooltipMagicGuildRankLine="立即在战斗地图上召唤生命之花，其治疗量根据英雄的魔法力量而定。"
mTooltipUpgraded="立即在目标2x2区域召唤 %special1.val1 个生命之花。\n它在战斗回合结束时治疗相邻盟友 %d2.min 到 %d2.max 点生命值，并拥有 %stat2 %icon_health 生命值。\n（冷却时间：%buff1.buff.durini 回合）\n如果英雄拥有超过12点 %icon_ARCANE_KNOWLEDGE 奥术知识，则冷却时间变为：%buff8.buff.durini 回合。"
mName="召唤生命之花"
mTooltip="立即在目标2x2区域召唤 %special1.val1 个生命之花。\n它在战斗回合结束时治疗相邻盟友 %d1.min 到 %d1.max 点生命值，并拥有 %stat1 %icon_health 生命值。\n如果英雄拥有土系学识III：生命之花获得+100% %icon_health 生命值，其治疗量增加 %res2。\n（冷却时间：%buff1.buff.durini 回合）\n如果英雄拥有超过12点 %icon_ARCANE_KNOWLEDGE 奥术知识，则冷却时间变为：%buff8.buff.durini 回合。"

v1.38

[A_Entangle H7HeroAbility]
mTooltipMagicGuild="降低目标敌方生物的 %buff1.buff.stat1.icon 移动力，并阻止其使用基于移动的技能，持续 %buff1.buff.durini 回合。"
mTooltipMagicGuildRankLine="%buff1.buff.stat1 %buff1.buff.stat1.icon 移动力"
mTooltipUpgraded="降低目标敌方生物 %buff1.buff.stat1.norm 点 %buff1.buff.stat1.icon 移动力，并阻止其使用基于移动的技能，持续 %buff1.buff.durini 回合。被缠绕的目标在移动时受到 %buff2.buff.d.min %buff2.buff.d.icon 土系伤害，持续 %buff2.buff.durini 回合。不影响传送类生物。\n（冷却时间：%buff9.buff.durini 回合）。"
mName="大地缠绕"
mTooltip="降低目标敌方生物 %buff1.buff.stat1.norm 点 %buff1.buff.stat1.icon 移动力，并阻止其使用基于移动的技能，持续 %buff1.buff.durini 回合。\n（冷却时间：%buff9.buff.durini 回合）。"

[A_Entangle_Buff H7BaseBuff]
mName="大地缠绕"
mTooltip="%stat %stat.icon 移动力 \n该生物无法使用基于移动的技能。\n持续 %durnow 回合。"